Tekla.Structures.Model.PolymeshEnumerator
The PolymeshEnumerator class is used to enumerate the polymesh of a pour's merged faces.

Tekla.Structures.Model.PolymeshEnumerator.enumerator
The enumerator holding polymeshes.

Tekla.Structures.Model.PolymeshEnumerator.#ctor(System.Collections.Generic.List{Tekla.Structures.Geometry3d.FacetedBrep})
Initializes a new instance of the Tekla.Structures.Model.PolymeshEnumerator class.
polymeshes: List of polymeshes

Tekla.Structures.Model.PolymeshEnumerator.Current
Gets the current polymesh.

Tekla.Structures.Model.PolymeshEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Model.PolymeshEnumerator.Reset
Resets the enumerator to the beginning.